window.dict = {
  "Contest Information": "赛事信息",
  "Solar Decathlon": "太阳能十项全能竞赛",
  "2020 Solar Decathlon Middle East": "2020 中东太阳能十项全能竞赛",
  "About us": "关于我们",
  "South China University of Technology": "华南理工大学",
  "Team x SCUT": "华南理工大学队",
  "Team Members": "队伍成员",
  "Project": "项目介绍",
  "Work Schedule": "工作日程",
  "Concept": "项目概念",
  "Blog": "博客",
  "Offline Sharing": "线上分享",
  "Dimdim's Weekly": "点点周记",
  "Former Works": "往届成果",
  "SDC 2013": "2013 中国太阳能十项全能竞赛",
  "SDC 2018": "2018 中国太阳能十项全能竞赛",
  "Support": "支持我们",
  "Sponsors": "赞助商",
  "Media Partners": "合作媒体",
  "Support TeamSCUT": "支持我们",
  "Contacts": "联系我们",
  "Group Architecture Design": "建筑设计组",
  "Group Contruction Tech": "建造技术组",
  "Group Equipment": "设备性能组",
  "Group Communication": "宣传运营组",
  "tr-home-1":
    "华南理工大学队即将参与在2020举行的中东国际太阳能十项全能竞赛（Solar Decathlon Middle Ease，SDME）是以全球高校为参赛单位的太阳能建筑科技竞赛。竞赛目的是借助世界顶尖研发、设计团队的技术与创意，将太阳能、节能与建筑设计以一体化的新方式紧密结合，设计、建造并运行一座高效节能、由吸引力的太阳能房屋，并希望通过比赛加快太阳能国际化的产学研融合与交流，推进相关技术创新、发展和商业化。",
  "tr-home-2":
    "华南理工大学队汇集了华工多方面的力量，包括建筑学院、材料学院、新闻与传播学院的本硕博学生。队伍有专业教师团队指导，并有学校与学院众多机构的支持，包括亚热带建筑科学国家重点实验室、数字化建造实验室、华南理工大学建筑设计研究院有限公司、发光材料与器材国家重点实验室。",
  "tr-home-3":
    "作为本届竞赛中国大陆唯一的参赛团队，今年，我们将跨出国门，走向世界，在更高的平台上展现来自中国团队的技术与实力：针对中东地区高温、高湿度、多灰尘的环境条件，一方面，我们将参考中东传统建筑气候适应性策略，进行我们的被动技术设计，如学习中东的捕风塔技术和中庭通风技术等；另一方面，我们也将结合现代尖端科技技术，整合现有的绿色建筑和人工智能技术，采用装配式住宅的快速搭建技术，建造出真正适应中东地区的高效可持续住宅。",
  "Solar Decathlon in U.S": "美国太阳能十项全能竞赛",
  "Solar Decathlon in China": "中国太阳能十项全能竞赛",
  "sdme-1": "在迪拜王储、迪拜执行委员会主席谢赫·哈姆丹·本·穆罕默德的支持下，2015年6月17日，迪拜能源最高委员会、迪拜电力水务管理局和美国能源部签署了一项协议，合作举办太阳能十项全能中东赛区比赛。",
  "sdme-2": "竞赛包括10个单项比赛，将遵循往届的比赛模式，但是比赛更加注重对中东地区的文化、气候和社会背景的思考，设计的方案需要在中东高温、多灰尘和高湿度的气候环境下实现可持续的目标。这些方案由多学科团队设计，让学生有机会了解技术问题、团队合作、沟通技巧、可持续的生活方式和社会经济问题，以确保项目的可行性。同时，赛事组委会也鼓励参赛团队与企业厂商加强合作，强调产学研融合与交流。",
  "sd-1": "国际太阳能十项全能竞赛（Solar Decathlon，SD）是由美国能源部发起并主办的，以全球高校为参赛单位的太阳能建筑科技竞赛。",
  "sd-2":
    "该竞赛由十个单项比赛组成，因此得名“十项全能”竞赛。目的是借助世界顶尖研发、设计团队的技术与创意，将太阳能、节能与建筑设计以一体化的新方式紧密结合，设计、建造并运行一座高效节能、由吸引力的太阳能房屋，并希望通过比赛加快太阳能国际化的产学研融合与交流，推进相关技术创新、发展和商业化。",
  "sd-3":
    "自2002年开始，大赛在美国、欧洲、中国、中东等国家地区成功举办，吸引了来自全球100多所大学参加比赛，展示了世界最新能源技 术成果以及能源节约技术。",
  "sd-4":
    "中国举办国际“太阳能十项全能竞赛”是2011 年胡锦涛主席对美国进行国事访问期间签署的第一个中美能源合作项目。2011年 1 月 19 日，胡锦涛主席与奥巴马总统白宫会晤时，特意谈及此事，两国领导人均表现出了对该赛事的高度重视和大力支持。",
  "sd-5": "2011年4月28日，中国国际太阳能十项全能竞赛启动仪式在北京大学英杰交流中心隆重举行。来自中国国家能源局、美国能源部、国内外著名能源企业、国内地方政府及国内知名高校的 200 多名代表共同见证了这一盛事。该竞赛由国家能源局、美国能源部联合主办，北京大学承办，企业界参与并提供相关支持。",
  "sd-6": "TeamSCUT 在迄今为止的两届竞赛中分别取 得 了 SDC2013 亚 军、SDC2018 冠 军的好成绩，今天，我们准备走向更大的国际舞台。",
  "Media Partners": "合作媒体",
  "tr-scut-1": "华南理工大学地处广州，是直属教育部的全国重点大学，也是首届“全国文明校园”获得单位。学校办学源远流长，最早可溯源至1918年并正式组建于1952年全国高等院校调整时期，为新中国四大工学院之一；1960年成为全国重点大学；1981年经国务院批准为首批博士和硕士学位授予单位；1993年在全国高校首开部省共建之先河；1995年进入“211工程”行列；2001年进入“985工程”行列；2017年入选“双一流”建设A类高校名单，2018年在“世界大学学术排名”中排名第201-300位。",
  "tr-scut-2": "如今的华南理工大学已经发展为一所以工见长，理、工、医结合，管、经、文、法等多学科协调发展的综合性研究型大学。轻工技术与工程、建筑学、食品科学与工程、化学工程与技术、环境科学与工程、材料科学与工程、机械工程、管理科学与工程等学科整体水平进入全国前10%；9个学科领域进入国际高水平学科ESI全球排名前1%，其中，工程学、材料科学、化学、农业科学4个学科领域进入前1‰，入选数在全国高校中并列排名第6位，华南地区首位。",
  "tr-scut-3": "建校以来，学校为国家培养了高等教育各类学生51万多人，一大批毕业校友成为中国科技骨干、著名企业家和领导干部。学校被誉为工程师和企业家的摇篮，毕业生就业率多年来位居全国高校和广东省高校前列。2017年，入选国家“双创”示范基地。",
  "tr-scut-4": "学校以雄厚的原始科研创新能力推动一流大学建设，建有27个国家级科研平台、185个部省级科研平台，数量位居全国高校前列、广东高校首位。2009年以来，累计获中国专利奖数量排名全国高校第一；2015年，专利技术转让指标居全国高校榜首。",
  "tr-scut-5": "2017年，华南理工大学广州国际校区由教育部、广东省、广州市和华南理工大学四方签约共建，这是学校“双一流”建设发展的新引擎，也是中国高等教育又一次新的探索。校区采用“中方为主、国际协同”的方式，依托学校现有优势学科资源和理工特色，与牛津大学、密西根大学等不少于20所世界著名一流高校强强联合，努力办成高水平、国际化、研究型、新工科特色的世界一流示范校区。",
  "tr-scut-6": "在新的历史发展起点上，学校提出了在建校100周年即2052年全面建成世界一流大学的战略目标。学校将秉承“博学慎思 明辨笃行”的校训，坚持学术立校、人才强校、开放活校、文化兴校，发扬“厚德尚学 自强不息 务实创新 追求卓越”的精神，紧紧抓住“双一流”建设和广州国际校区建设的重要契机，坚持内涵发展，深化综合改革，全面提高质量，向着世界一流大学的目标奋勇前进。",
  "tr-ts-1": "华南理工大学队由多方力量组成，，包括亚热带建筑科学国家重点实验室、数字化建造实验室、华南理工大学建筑设计研究院有限公司、发光材料与器材国家重点实验室。与众多机构的合作为我们在科研技术以及硬件设备上提供了良好的基础，这些基础设施都是使我们团队的项目最终可以成功落实的有力条件。",
  "tr-ts-2": "经科技部批准设立国家亚热带建筑科学重点实验室，是我国高校建筑领域唯一的国家重点实验室。该实验室目前有三个实验中心：建筑设计科学、建筑技术科学和建筑工程技术。包括现代建筑创作、生态城市与绿色建筑、数字媒体技术、地理信息系统技术、传统建筑文化与保护、建筑热环境与建筑节能、建筑声学、建筑光学、建筑结构。有减灾、建设监测与健康监测、岩土与地下结构、城乡环境工程等13个分实验室，拥有先进科研仪器1107套，固定科研人员80人。",
  "tr-ts-3": "数字化建造实验室目前拥有三个机械臂、五台3D打印机、六台激光雕刻机等设备。",
  "tr-ts-4": "华南理工大学建筑设计研究所是中国著名的甲级设计院，是一支技术力量雄厚、人员结构合理、专业装备齐全、设计技术先进的设计院，质量保证体系在国内同行业中具有先进水平。",
  "tr-ts-5": "该实验室拥有总值近2亿元的先vv进设备，承担了多项国家重大科研任务，取得了一批具有影响力的成果。同时，实验室积极开展对外开放，建立了聚合物塑料光伏材料基地引进人才，并与世界一流公司建立了实质性的合作伙伴关系。",
  "sdc13-1": "E-CONCAVE房屋采用模块化预制装配呼应着当今中国的工业化进程，实现快速预制，建造及方便的运输。竹材的使用，宜人的景观，为住户提供纯净舒适的居住空间，在夏季，吹过水池的风，带着湿润的水汽，由全开的中庭进入室内降低温度。在节能、宜居、模块化、科技这四个方面，E-concave实现了全面的创新突破。",
  "sdc13-2": "为了最大化获取太阳能资源，E-concave将光伏板以3度为夹角铺满屋顶的策略，通过计算机模拟得出了生产比耗电量还多1.5倍的清洁能源。三块光伏光热一体化组件模块位于屋顶末端，既可以高效的产生热水又可以产生电能，与此同时还设置了一套光伏清洁系统以提高发现效率。",
  "sdc13-3": "在水处理方面，E-concave进行了雨水收集，并将雨水及生产生活用水通过过滤模块，人工湿地和消毒模块的净化处理，产生清洁的二次用水，同时人工湿地起到了调节建筑微气候的作用。可再生的环保建材也被广泛的应用于建造技术创新之中，并采用了创新的甘蔗聚氨酯保温材料，起到了良好的保温隔热作用。",
  "sdc13-4": "此外，在空调系统创新中，采用了多功能VRV系统，为室内提供高品质温湿度环境的同时，将空气源热泵技术，空调冷凝技术运用于屋顶采暖系统，通过压缩机把空气中的低温热能变为高温热能传输至地暖管和热水箱，与太阳能光伏观点系统完美联动。在整栋建筑上实现了太阳能光伏光电一体化。",
  "sdc13-5": "Team SCUT在2013年第一届中国国际太阳能十项全能竞赛中获得了总分第二名，并分别在市场推广、家庭娱乐、热水、电器和能量平衡五个单项中荣获第一名，在工程设计单项比赛中获得第二名，在建筑设计和宣传两个单项中获得第三名。",
  "sdc13-6": "申请了两项专利——《太阳能与空气源热泵一体化的家用型热水空调系统发明》《基于Kinect的手势识别智能家居控制方法及系统》。另外团队成员参与编写《单层独立式太阳能住宅空间设计与被动式策略的结合与研究》、《小型装配式建筑全专业BIM技术应用研究》、《独立式太阳能住宅设计》、《绿色模拟分析软件在独立式太阳能住宅全设计周期中的应用研究》等国家创新研究计划项目。",
  "sdc18-1": "“长屋计划”通过建筑学秩序的控制提高空间的使用自由度，并提倡重拾自然生活的理念。作为维系着住户间情感的长长的纽带，长屋计划，以传统而智慧的平面布局方式，借助零能耗的技术，整合人居舒适(+) 、节能减排(-)、城市效应(×)、模块建造(÷) 四大策略，让生态、人文、科技的生活回归城市，让历史走向未来。",
  "sdc18-2": "(1) 被动技术：阳光房与多个天井的“生态核心”嵌入狭长的体量中，将自然的空气、水分、阳光、土壤、生物引入房屋，将原本封闭阴暗的空间变成舒适而宜居的场所，为的城市生活注入活力。在夏季“生态核心”打开，自然通风舒适宜人；而在冬季“生态核心”关闭，配合高性能的围护保温结构，阳光房摄入的能量大大降低了采暖消耗。",
  "sdc18-3": "(2) 生态核心：运用景观技术将生态系统与住宅相结合，半室外中庭里利用雨水的垂直绿墙、为家庭健康提供服务的鱼菜养殖系统和社区级别的雨水花园成为城市住宅生态的不可缺少的要素，全屋系统形成一个完整雨水循环，加快生态碳吸收速率。",
  "sdc18-4": "(3) 高效能源：从设备到调控各层面减少房屋带来的能源与资源的损耗，我们鼓励环保绿色节能的设计与生活方式。在有限的屋面面积下，高效的整合光伏系统。",
  "sdc18-5": "(4) 智能管家：长屋智能管家掌握一套机器学习算法(AI)，通过实时数据与用户反馈计算出满足舒适需求同时最节能的设备运作模式并自动调控。完善便捷的智能交互系统，适用于年轻人的生活情景，智能的能源管理系统可以让住户方便的管控房屋的水电设备。",
  "sdc18-6": "长屋计划获得了SDC2018总分冠军，工程设计第一名、创新能力第一名、市场潜力第二名、建筑设计第二名、宣传推广第四名的好成绩。",
  "tr-climate-1": "在迪拜，夏季长、酷热、闷热难受、干旱和部分多云，冬季舒适、干燥和大部分晴天。 在一年中，气温通常在14°C到41°C之间变化，极少低于11°C或高于44°C。",
  "tr-climate-2": "根据沙滩/泳池得分，拜访迪拜开展热天活动的最佳时间是四月整月和从十月中旬至十一月下旬。",
  "tr-temperature-1": "炎热季节持续4.3个月，从5月13日到9月23日，每日平均高温超过38°C。 一年中最热的一天是8月1日，平均高温为41°C，平均低温为30°C。",
  "tr-temperature-2": "凉爽季节持续3.1个月，从12月2日到3月4日，每日平均高温低于27°C。 一年中最冷的一天是1月15日，平均低温为14°C，平均高温为24°C。",
  "tr-temperature-3": "用第25-75和第10-90百分位区间表示的每日平均高温（红线）和低温（蓝线）。 细虚线是对应的平均感知气温。",
  "tr-temperature-4": "下图向您显示全年每小时平均气温的简要特征。 横轴表示一年中的天，纵轴表示一天中的小时，颜色是该小时和天的平均气温。",
  "tr-temperature-5": "每小时平均温度，加以数带着色。 阴影叠加表示夜晚和民用曙光/暮光。",
  "tr-cloud-1": "在迪拜，天空被云彩覆盖的平均百分比全年经历较大的季节性变化。",
  "tr-cloud-2": "在迪拜，一年中较晴朗的天气在9月1日前后开始，持续6.9个月，在3月31日前后终止。 10月4日是一年中最晴朗的日子，93%的时间天空晴朗、大部分晴朗或部分多云，7%的时间多云或大部分多云。",
  "tr-cloud-3": "一年中较多云的天气在3月31日前后开始，持续5.1个月，在9月1日前后终止。 7月21日是一年中最多云的日子，50%的时间天空多云或大部分多云，50%的时间晴朗、大部分晴朗或部分多云。",
  "tr-cloud-4": "在每一云彩覆盖带所花时间的百分比，按天空被云彩覆盖的百分比分类。",
  "tr-preci-1": "迪拜在潮湿天气（即有超过1毫米水分或水当量降水的天气）频率方面有较大的季节性变化。 频率范围从0%到8%，平均值为3%。",
  "tr-preci-2": "我们将潮湿的天气区分为仅下雨、仅下雪或雨夹雪。 根据本分类，全年最常见的降水形式是仅下雨，其峰值概率为8%，在3月14日。",
  "tr-preci-3": "观察到不同类型降水的天数百分比（不包括微量）：仅为雨水、仅为雪水和雨雪混合（同一天既下雨又下雪）。",
  "tr-rain-1": "为了显示几个月内的变化，而不仅仅是显示每月总量，我们显示以一年中的每一天为中心的、连续31天阶段的累计降雨量，。 迪拜的每月降雨量有一些季节性变化。",
  "tr-rain-2": "一年的多雨阶段持续2.4个月，从1月6日到3月17日，其相关31天的降雨量至少为13毫米。 在以2月5日为中心的31天期间降雨最多，平均总累计雨量为17毫米。",
  "tr-rain-3": "一年中最少降雨的阶段持续9.6个月，从3月17日到1月6日。 最少雨的日期在8月21日前后，平均总累计降雨量为0毫米。",
  "tr-rain-4": "用第25-75和第10-90百分位区间表示在滑动31天期间累积、以相关日期为中心的平均降雨（实线）。 细虚线是对应的平均水当量降雪。",
  "tr-sun-1": "迪拜的白天长度全年变化。 2020年，最短的一天是12月21日，有10小时35分钟的日光；最长的一天是6月21日，有13小时42分钟的日光。",
  "tr-sun-2": "可见太阳的时数（黑线）。 从下（最深的黄色）至上（最深的灰色），颜色带表示：全日光、曙光/暮光（民用、航海和天文）和全黑夜。",
  "tr-sun-3": "最早的日出日期和时间是6月9日 上午5:28，最晚的日出时间比最早的日出时间晚1小时38分钟，在1月14日 上午7:06。 最早的日落日期和时间是11月29日 下午5:29，最晚的日落时间比最早的日落时间晚1小时44分钟，在7月1日 下午7:13。",
  "tr-sun-4": "2020年的太阳日。 从下至上，黑线是前一个日照午夜、日出、日照中午、日落和下一个日照午夜。 白天、曙光/暮光（民用、航海和天文）和夜晚用从黄色到灰色颜色带表。",
  "tr-solar-1": "本节讨论达到大面积地表的总每日入射短波太阳能，全面考虑白天长度、太阳超过地平线的高度以及被云彩和其他大气成分吸收的季节性变化。 短波辐射包括可见光和紫外线辐射。",
  "tr-solar-2": "平均每日入射短波太阳能全年经历较大季节性变化。",
  "tr-solar-3": "一年中较明亮的阶段持续2.6个月，从4月25日到7月12日，每平方米平均每日入射短波能量超过7.2千瓦时。 一年中最明亮的一天是6月3日，平均能量为8.0千瓦时。",
  "tr-solar-4": "一年中较黑暗的阶段持续2.9个月，从11月10日到2月5日，每平方米平均每日入射短波能量低于4.9千瓦时。 一年中最黑暗的一天是12月19日，平均能量为4.1千瓦时。",
  "tr-solar-5": "用第25-75和第10-90百分位区间表示的每平方米达到地面的平均每日短波太阳能（橘黄线条）。",
  "tr-humid-1": "我们根据露点确定湿度舒适度，因为露点决定汗水是否会从皮肤上蒸发，从而使身体感到凉爽。 较低的露点产生较干燥的感觉，较高的露点产生较潮湿的感觉。 与气温不同（气温通常在夜间和白天差别很大），露点的变化较慢，因此虽然气温在夜间可能下降，闷热的白天通常会接着有闷热的夜晚。",
  "tr-humid-2": "迪拜的感知湿度有极大季节性变化。",
  "tr-humid-3": "一年的较闷热阶段持续7.3个月，从4月12日到11月21日，在此阶段至少有23%的时间舒适度为闷热、压抑或难受23%。 一年中最闷热的一天是7月28日，89%的时间会出现闷热气况。",
  "tr-humid-4": "一年中最闷热的一天是1月16日，1%的时间会出现闷热气况。",
  "tr-humid-5": "在各湿度舒适水平所花时间的百分比，按露点分类。",
  "tr-wind-1": "本节讨论在地面上方10米的广域小时平均风矢量（速度和方向）。 在任何一个特定地点经历的刮风在很大程度上取决于当地地形和其他因素，瞬时风速和风向比小时平均值变化更大。",
  "tr-wind-2": "在迪拜，平均小时风速经历很小的季节性变化。",
  "tr-wind-3": "一年中较多风的阶段持续5.2个月，从12月30日到6月6日，平均风速超过每小时13.1公里。 一年中最多风的一天是3月14日，平均小时风速为每小时15.0公里。",
  "tr-wind-4": "一年中较平静的阶段持续6.7个月，从6月6日到12月30日。 一年中最平静的一天是10月11日，平均小时风速为每小时11.1公里。",
  "tr-wind-5": "用第25-75和第10-90百分位区间表示的每小时平均风速（深灰色线条）。",
  "tr-wind-6": "迪拜占主导地位的平均小时风向全年变化。",
  "tr-wind-7": "风经常来自东面，持续4.3周，从8月2日到9月1日，峰值百分比为32%，在8月18日。 风经常来自西面，持续11个月，从9月1日到8月2日，峰值百分比为51%，在1月1日。",
  "tr-wind-8": "平均风向来自四个主要风向的时数百分比，不包括平均风速低于每小时1.6公里的时数。 边界上的浅色区域是在隐含中间方向（东北、东南、西南和西北）度过的时数百分比。",
  "tr-water-1": "迪拜临近大片水域（例如，海洋、大海或大湖）。 本节报告该水域的大范围平均表面气温。",
  "tr-water-2": "平均水温全年经历极大季节性变化。",
  "tr-water-3": "一年中出现较热水温的时间持续4.1个月，从6月12日到10月15日，平均水温超过31°C。 一年中最热水温的一天是8月6日，平均水温为33°C。",
  "tr-water-4": "一年中出现较凉水温的时间持续3.3个月，从12月25日到4月4日，平均水温低于24°C。 一年中最凉水温的一天是2月9日，平均水温为21°C。",
  "tr-water-5": "用第25-75和第10-90百分位区间表示的每日平均水温（紫色线条）。",
  "tr-visit-1": "为了描绘迪拜全年的宜人天气，我们计算两项旅行得分。",
  "tr-visit-2": "旅游得分偏向晴朗、不下雨的日子，感知温度在18°C和27°C之间。 根据此得分，拜访迪拜开展一般户外旅游活动的最佳时间是从十一月中旬至三月下旬，其中得分最高的是十二月第三周。",
  "tr-visit-3": "旅游得分（填充区域）及其组成：温度得分（红线），云量得分（蓝线），以及降水得分（绿线）。",
  "tr-visit-4": "沙滩/泳池得分偏向晴朗、不下雨的日期，感知温度在24°C和32°C之间。 根据此得分，拜访迪拜开展热天活动的最佳时间是四月整月和从十月中旬至十一月下旬，其中得分最高的是十一月第一周。",
  "tr-visit-5": "沙滩/泳池得分（填充区域）及其组成：温度得分（红线），云量得分（蓝线），以及降水得分（绿线）。",
  "tr-sponsor-1": "作为本次竞赛中国大陆唯一的参赛团队,今年,我们将跨出国门,走向世界,在更高的平台上展现来自中国团队的技术与实力:我们将协同跨学科专业技术与设计团队,采用可持续的被动技术和新进的主动技术,一体化结合工学与美学,设计与建造具有高效节能、有社会积极效应的太阳能房屋。在此过程中我们需要相关的技术、产品与资金的支持。为此,我们希望有志于推动国际太阳能绿色建筑发展的相关政府部门、技术产品企业和社会热心人士能够给予我们帮助!",
  "tr-sponsor-2": "根据赞助商所赞助的折合价值总额，我们将赞助商分级为特级、一级、二级、三级赞助商，并作出以下回馈项目：",


















};



// 翻译组件
window.zh = false;
window.tr = function(el) {
  var en = $(el).attr("data-tr");
  var key = $(el).attr("data-tr-key");
  if (!key) {
    key = en;
  }
  if (window.zh) {
    if (!!$(el).attr("data-tr-zh")) {
      $(el).text($(el).attr("data-tr-zh"));
    } else {
      $(el).text(window.dict[key]);
    }
    return;
  }
  $(el).text(en);
};
window.toggleLocale = function(nochange) {
  if (!nochange) {
    window.zh = !window.zh;
  }
  $("[data-tr]").map(function(id, el) {
    tr(el);
  });
  $($("iframe").contents()).find("[data-tr]").map(function(id, el) {
    tr(el);
  });
  if (typeof window.localeChanged == "function") {
    window.localeChanged();
  }
};
window.reloadLocaleScope = function(scope) {
  $("[data-tr]", scope).map(function(id, el) {
    if (!!$(el).attr("data-tr-inited")) return;
    if (!!$(el).attr("data-tr-key")) {
      return;
    }

    if ($(el).attr("data-tr") == "") {
      $(el).attr("data-tr", $(el).text());
    } else {
      $(el).text($(el).attr("data-tr"));
    }

    $(el).attr("data-tr-inited", "true");
  });
  $("[data-tr-key],[data-tr-zh]", scope).map(function(i, el) {
    if (!!$(el).attr("data-tr-inited")) return;
    $(el).attr("data-tr", $(el).text());
    $(el).attr("data-tr-inited", "true");
  });
  toggleLocale(true);
};
window.reloadLocale = function () {
  reloadLocaleScope(document);
  reloadLocaleScope($("iframe").contents());
}

// 前端路由加载器
function load(page) {
  if (!!page == "") page = "home";
  $("#app").load("./components/" + page + ".html", null, function() {
    reloadLocale();
    $("iframe").on('load', reloadLocale);
    // 加载完毕，如果导航栏处于打开状态，收起之
    var expanded = Number($(".tmc-navbar").attr("data-expanded"));
    if (expanded == 0) return;
    $(".tmc-navbar").animate({
      right: expanded == 0 ? "0px" : "-85vw"
    });
    $(".tmc-navbar").attr("data-expanded", 1 - expanded);
  });
}
window.onhashchange = function(e) {
  if (window.location.hash == "") return;
  var hash = window.location.hash.substr(1);
  // 用于给各个单独的组件取消注册一些定时器之类的
  if (typeof window.beforeLoad == "function") {
    window.beforeLoad();
  }
  load(hash);
};

// 在页面载入完成后执行各组件的初始化
$(function() {
  // load 完成后会自动载入 locale，这里就不用手动重载入了
  load(window.location.hash.substr(1));
});
