window.dict = {
  "Contest Information": "赛事信息",
  "Solar Decathlon": "太阳能十项全能竞赛",
  "2020 Solar Decathlon Middle East": "2020 中东太阳能十项全能竞赛",
  "About us": "关于我们",
  "South China University of Technology": "华南理工大学",
  "Team x SCUT": "华南理工大学队",
  "Team Members": "队伍成员",
  "Project": "项目介绍",
  "Work Schedule": "工作日程",
  "Concept": "项目概念",
  "Blog": "博客",
  "Offline Sharing": "线上分享",
  "Dimdim's Weekly": "点点周记",
  "Former Works": "往届成果",
  "SDC 2013": "2013 中国太阳能十项全能竞赛",
  "SDC 2018": "2018 中国太阳能十项全能竞赛",
  "Support": "支持我们",
  "Sponsors": "赞助商",
  "Media Partners": "合作媒体",
  "Support TeamSCUT": "支持我们",
  "Contacts": "联系我们",
  "- more information -": "- 详情 -",
  "tr-home-1":
    "华南理工大学队即将参与在2020举行的中东国际太阳能十项全能竞赛（Solar Decathlon Middle Ease，SDME）是以全球高校为参赛单位的太阳能建筑科技竞赛。该竞赛由十个单项比赛组成，因此得名“十项全能”竞赛。竞赛目的是借助世界顶尖研发、设计团队的技术与创意，将太阳能、节能与建筑设计以一体化的新方式紧密结合，设计、建造并运行一座高效节能、由吸引力的太阳能房屋，并希望通过比赛加快太阳能国际化的产学研融合与交流，推进相关技术创新、发展和商业化。",
  "tr-home-2":
    "华南理工大学队汇集了华工多方面的力量，包括建筑学院、材料学院、新闻与传播学院的本硕博学生。队伍有专业教师团队指导，并有学校与学院众多机构的支持，包括亚热带建筑科学国家重点实验室、数字化建造实验室、华南理工大学建筑设计研究院有限公司、发光材料与器材国家重点实验室。",
  "tr-home-3":
    "作为本届竞赛中国大陆唯一的参赛团队，今年，我们将跨出国门，走向世界，在更高的平台上展现来自中国团队的技术与实力：针对中东地区高温、高湿度、多灰尘的环境条件，一方面，我们将参考中东传统建筑气候适应性策略，进行我们的被动技术设计，如学习中东的捕风塔技术和中庭通风技术等；另一方面，我们也将结合现代尖端科技技术，整合现有的绿色建筑和人工智能技术，采用装配式住宅的快速搭建技术，建造出真正适应中东地区的高效可持续住宅。",
  "Solar Decathlon in U.S": "美国太阳能十项全能竞赛",
  "Solar Decathlon in China": "中国太阳能十项全能竞赛",
  "sdme-1": "在迪拜王储、迪拜执行委员会主席谢赫·哈姆丹·本·穆罕默德的支持下，2015年6月17日，迪拜能源最高委员会、迪拜电力水务管理局和美国能源部签署了一项协议，合作举办太阳能十项全能中东赛区比赛。",
  "sdme-2": "竞赛包括10个单项比赛，将遵循往届的比赛模式，但是比赛更加注重对中东地区的文化、气候和社会背景的思考，设计的方案需要在中东高温、多灰尘和高湿度的气候环境下实现可持续的目标。这些方案由多学科团队设计，让学生有机会了解技术问题、团队合作、沟通技巧、可持续的生活方式和社会经济问题，以确保项目的可行性。同时，赛事组委会也鼓励参赛团队与企业厂商加强合作，强调产学研融合与交流。",
  "sd-1": "国际太阳能十项全能竞赛（Solar Decathlon，SD）是由美国能源部发起并主办的，以全球高校为参赛单位的太阳能建筑科技竞赛。",
  "sd-2":
    "该竞赛由十个单项比赛组成，因此得名“十项全能”竞赛。目的是借助世界顶尖研发、设计团队的技术与创意，将太阳能、节能与建筑设计以一体化的新方式紧密结合，设计、建造并运行一座高效节能、由吸引力的太阳能房屋，并希望通过比赛加快太阳能国际化的产学研融合与交流，推进相关技术创新、发展和商业化。",
  "sd-3":
    "自2002年开始，大赛在美国、欧洲、中国、中东等国家地区成功举办，吸引了来自全球100多所大学参加比赛，展示了世界最新能源技 术成果以及能源节约技术。",
  "Media Partners": "合作媒体",
  "tr-scut-1": "华南理工大学地处广州，是直属教育部的全国重点大学，也是首届“全国文明校园”获得单位。学校办学源远流长，最早可溯源至1918年并正式组建于1952年全国高等院校调整时期，为新中国四大工学院之一；1960年成为全国重点大学；1981年经国务院批准为首批博士和硕士学位授予单位；1993年在全国高校首开部省共建之先河；1995年进入“211工程”行列；2001年进入“985工程”行列；2017年入选“双一流”建设A类高校名单，2018年在“世界大学学术排名”中排名第201-300位。",
  "tr-scut-2": "如今的华南理工大学已经发展为一所以工见长，理、工、医结合，管、经、文、法等多学科协调发展的综合性研究型大学。轻工技术与工程、建筑学、食品科学与工程、化学工程与技术、环境科学与工程、材料科学与工程、机械工程、管理科学与工程等学科整体水平进入全国前10%；9个学科领域进入国际高水平学科ESI全球排名前1%，其中，工程学、材料科学、化学、农业科学4个学科领域进入前1‰，入选数在全国高校中并列排名第6位，华南地区首位。",
  "tr-scut-3": "建校以来，学校为国家培养了高等教育各类学生51万多人，一大批毕业校友成为中国科技骨干、著名企业家和领导干部。学校被誉为工程师和企业家的摇篮，毕业生就业率多年来位居全国高校和广东省高校前列。2017年，入选国家“双创”示范基地。",
  "tr-scut-4": "学校以雄厚的原始科研创新能力推动一流大学建设，建有27个国家级科研平台、185个部省级科研平台，数量位居全国高校前列、广东高校首位。2009年以来，累计获中国专利奖数量排名全国高校第一；2015年，专利技术转让指标居全国高校榜首。",
  "tr-scut-5": "2017年，华南理工大学广州国际校区由教育部、广东省、广州市和华南理工大学四方签约共建，这是学校“双一流”建设发展的新引擎，也是中国高等教育又一次新的探索。校区采用“中方为主、国际协同”的方式，依托学校现有优势学科资源和理工特色，与牛津大学、密西根大学等不少于20所世界著名一流高校强强联合，努力办成高水平、国际化、研究型、新工科特色的世界一流示范校区。",
  "tr-scut-6": "在新的历史发展起点上，学校提出了在建校100周年即2052年全面建成世界一流大学的战略目标。学校将秉承“博学慎思 明辨笃行”的校训，坚持学术立校、人才强校、开放活校、文化兴校，发扬“厚德尚学 自强不息 务实创新 追求卓越”的精神，紧紧抓住“双一流”建设和广州国际校区建设的重要契机，坚持内涵发展，深化综合改革，全面提高质量，向着世界一流大学的目标奋勇前进。",
  "tr-ts-1": "华南理工大学队由多方力量组成，，包括亚热带建筑科学国家重点实验室、数字化建造实验室、华南理工大学建筑设计研究院有限公司、发光材料与器材国家重点实验室。与众多机构的合作为我们在科研技术以及硬件设备上提供了良好的基础，这些基础设施都是使我们团队的项目最终可以成功落实的有力条件。",
  "tr-ts-2": "经科技部批准设立国家亚热带建筑科学重点实验室，是我国高校建筑领域唯一的国家重点实验室。该实验室目前有三个实验中心：建筑设计科学、建筑技术科学和建筑工程技术。包括现代建筑创作、生态城市与绿色建筑、数字媒体技术、地理信息系统技术、传统建筑文化与保护、建筑热环境与建筑节能、建筑声学、建筑光学、建筑结构。有减灾、建设监测与健康监测、岩土与地下结构、城乡环境工程等13个分实验室，拥有先进科研仪器1107套，固定科研人员80人。",
  "tr-ts-3": "数字化建造实验室目前拥有三个机械臂、五台3D打印机、六台激光雕刻机等设备。",
  "tr-ts-4": "华南理工大学建筑设计研究所是中国著名的甲级设计院，是一支技术力量雄厚、人员结构合理、专业装备齐全、设计技术先进的设计院，质量保证体系在国内同行业中具有先进水平。",
  "tr-ts-5": "该实验室拥有总值近2亿元的先vv进设备，承担了多项国家重大科研任务，取得了一批具有影响力的成果。同时，实验室积极开展对外开放，建立了聚合物塑料光伏材料基地引进人才，并与世界一流公司建立了实质性的合作伙伴关系。",
  "x1": ""

};
  


// 翻译组件
window.zh = false;
window.tr = function(el) {
  var en = $(el).attr("data-tr");
  var key = $(el).attr("data-tr-key");
  if (!key) {
    key = en;
  }
  if (window.zh) {
    if (!!$(el).attr("data-tr-zh")) {
      $(el).text($(el).attr("data-tr-zh"));
    } else {
      $(el).text(window.dict[key]);
    }
    return;
  }
  $(el).text(en);
};
window.toggleLocale = function(nochange) {
  if (!nochange) {
    window.zh = !window.zh;
  }
  $("[data-tr]").map(function(id, el) {
    tr(el);
  });
};
window.reloadLocale = function() {
  $("[data-tr]").map(function(id, el) {
    if (!!$(el).attr("data-tr-inited")) return;
    if (!!$(el).attr("data-tr-key")) {
      return;
    }

    if ($(el).attr("data-tr") == "") {
      $(el).attr("data-tr", $(el).text());
    } else {
      $(el).text($(el).attr("data-tr"));
    }

    $(el).attr("data-tr-inited", "true");
  });
  $("[data-tr-key],[data-tr-zh]").map(function(i, el) {
    if (!!$(el).attr("data-tr-inited")) return;
    $(el).attr("data-tr", $(el).text());
    $(el).attr("data-tr-inited", "true");
  });
  toggleLocale(true);
};

// 初始化 roller
var imgCur = {};
var imgTot = {};
function reloadRoller() {
  $(".tmc-img-roller").map(function(i, el) {
    var rid = $(el).attr("id");
    if (!rid) console.error("cnm 忘记给 roller 设 id 了", el);
    if (!window.imgCur[rid]) window.imgCur[rid] = 0;
    window.imgTot[rid] = $(el).children().length;
  });
}
// 初始化结束

// 前端路由加载器
function load(page) {
  if (!!page == "") page = "home";
  $("#app").load("./components/" + page + ".html", null, function() {
    reloadLocale();
    reloadRoller();
    // 加载完毕，如果导航栏处于打开状态，收起之
    var expanded = Number($(".tmc-navbar").attr("data-expanded"));
    if (expanded == 0) return;
    $(".tmc-navbar").animate({
      right: expanded == 0 ? "0px" : "-85vw"
    });
    $(".tmc-navbar").attr("data-expanded", 1 - expanded);
  });
}
window.onhashchange = function(e) {
  if (window.location.hash == "") return;
  var hash = window.location.hash.substr(1);
  // 用于给各个单独的组件取消注册一些定时器之类的
  if (typeof window.beforeLoad == "function") {
    window.beforeLoad();
  }
  load(hash);
};

// 在页面载入完成后执行各组件的初始化
$(function() {
  // load 完成后会自动重新载入 roller 和 locale，这里就不用手动重载入了
  load(window.location.hash.substr(1));
});
